"%@ days ago" = "Hace %@ días";
"Autocomplete" = "Autocompletar";
"Blog" = "Blog";
"Close all" = "Cerrar todo";
"Ecosia recommends" = "Ecosia recomienda";
"Ecosia won’t remember the pages you visited, your search history or your autofill information once you close a tab. Your searches still contribute to trees." = "Ecosia no recordará las páginas que has visitado, tu historial de búsqueda ni completará información automáticamente una vez que hayas cerrado una pestaña. Y aun así, tus búsquedas seguirán contribuyendo a los árboles.";
"Explore Ecosia" = "Descubre Ecosia";
"FAQ" = "Preguntas frecuentes";
"Financial reports" = "Reportes financieros";
"Force Dark Mode" = "Modo oscuro";
"Get started" = "Iniciar";
"How Ecosia works" = "Cómo funciona Ecosia";
"Invert website colors" = "Invertir los colores del sitio web";
"Keep up to date with the latest news from our projects and more" = "Mantente al día con las últimas novedades de nuestros proyectos y mucho más";
"Moderate" = "Moderado";
"More" = "Más";
"My searches" = "Mis búsquedas";
"New" = "Nueva";
"Off" = "Desactivado";
"Private" = "Privado";
"Personalized results" = "Resultados personalizados";
"Plant trees while you browse the web" = "Planta arboles mientras navegas";
"Privacy" = "Privacidad";
"Relevant results based on past searches" = "Resultados relevantes basados en búsquedas anteriores";
"Safe search" = "Búsqueda segura";
"Search" = "Buscar";
"Search the web to plant trees..." = "Busca para plantar árboles...";
"Search region" = "Región de búsquedas";
"Send feedback" = "Enviar comentarios";
"Shop" = "Tienda";
"Shown under the search field" = "Se muestra bajo el cuadro de búsqueda";
"Start using these green companies to plant more trees and become more sustainable" = "Empieza a utilizar estas empresas verdes para plantar más árboles y ser más sostenible";
"Stories" = "Noticias";
"Strict" = "Estricto";
"TREES" = "árboles";
"TREES PLANTED WITH ECOSIA" = "árboles plantados con Ecosia";
"Terms and conditions" = "Condiciones de servicio";
"Version %@" = "Versión %@";
"We use the profit from your searches to plant trees where they are needed most" = "Usamos las ganancias de tus busquedas para plantar arboles donde mas se necesitan";
"Websites will always open with Ecosia, planting even more trees" = "Las páginas web se abrirán siempre con Ecosia y se plantarán aún más árboles";
"You need around 45 searches to plant a tree. Keep going!" = "Necesitas cerca de 45 busquedas para plantar un árbol. ¡Tu puedes!";
"Help us improve our new app" = "Ayúdanos a mejorar nuestra nueva aplicación";
"Let us know what you like, dislike, and want to see in the future." = "Dinos lo que te gusta, lo que no y lo que te gustaría ver en el futuro.";
"Share your feedback" = "Comparte tu opinión";
"Sit tight, we are getting ready for you…" = "Espera un momento, nos estamos preparando para ti";
"We hit a glitch" = "Tenemos un problema técnico";
"We are momentarily unable to load all of your settings." = "En este momento no podemos cargar tu configuración.";
"Continue" = "Continuar";
"Welcome to the new Ecosia app!" = "¡Te damos la bienvenida a la nueva app de Ecosia! ";
"We've done some re-arranging to make it easier for you to browse the web and plant trees with Ecosia." = "La reacomodamos para facilitar la búsqueda en la web y la plantación de árboles con Ecosia.";
"Take a look" = "Echa un vistazo.";
"Set Ecosia as default browser" = "Establecer Ecosia como navegador predeterminado";
"Links from websites, emails or messages will automatically open in Ecosia." = "Los vínculos de sitios web, correos electrónicos o mensajes se abrirán automáticamente en Ecosia.";
"Show Top Sites" = "Mostrar Frecuentes";
